import "./PostBlock.css";
import user from "../../../../Images/Users/user2.png";
import { Link } from "react-router-dom";
import { useState } from "react";
import { IPost } from "../PostRow/PostRow";

export default function PostBlock(props: {
  post: IPost[];
  setPost: React.Dispatch<React.SetStateAction<IPost[]>>;
}) {
  const [postMessage, setPostMessage] = useState("");

  const submitPost = (e: React.FormEvent<HTMLFormElement>) => {
    e.preventDefault();
    var newPost = {
      UserID: 3,
      Image: null,
      Description: postMessage,
      Hearts: 0,
      Comments: 0,
    };
    props.setPost((current) => [newPost, ...current]);
    console.log(props.post);
  };
  return (
    <div className="PostBlock">
      <div className="PostHeader">
        <div className="PostProfile">
          <Link to="/Profile/3">
            <img src={user} alt="userProfile" />
          </Link>
        </div>
        <form onSubmit={(e) => submitPost(e)}>
          <input
            type="text"
            placeholder="გაგვიზიარე რამე..."
            value={postMessage}
            onChange={(e) => setPostMessage(e.target.value)}
          />
          <button>გამოქვეყნება</button>
        </form>
      </div>
      <div className="Line"></div>
      <div className="PostOptionsRow">
        <div className="PostButton">
          <svg
            width="28"
            height="28"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M22.0192 16.8201L18.8892 9.50009C18.3192 8.16009 17.4692 7.40009 16.4992 7.35009C15.5392 7.30009 14.6092 7.97009 13.8992 9.25009L11.9992 12.6601C11.5992 13.3801 11.0292 13.8101 10.4092 13.8601C9.77916 13.9201 9.14916 13.5901 8.63916 12.9401L8.41916 12.6601C7.70916 11.7701 6.82916 11.3401 5.92916 11.4301C5.02916 11.5201 4.25916 12.1401 3.74916 13.1501L2.01916 16.6001C1.39916 17.8501 1.45916 19.3001 2.18916 20.4801C2.91916 21.6601 4.18916 22.3701 5.57916 22.3701H18.3392C19.6792 22.3701 20.9292 21.7001 21.6692 20.5801C22.4292 19.4601 22.5492 18.0501 22.0192 16.8201ZM6.97016 8.38109C7.86659 8.38109 8.72631 8.02499 9.36018 7.39111C9.99405 6.75724 10.3502 5.89753 10.3502 5.00109C10.3502 4.10466 9.99405 3.24495 9.36018 2.61107C8.72631 1.9772 7.86659 1.62109 6.97016 1.62109C6.07373 1.62109 5.21401 1.9772 4.58014 2.61107C3.94627 3.24495 3.59016 4.10466 3.59016 5.00109C3.59016 5.89753 3.94627 6.75724 4.58014 7.39111C5.21401 8.02499 6.07373 8.38109 6.97016 8.38109Z"
              fill="#35FF9E"
            />
          </svg>
          ფოტო/ვიდეო
        </div>
        <div className="PostButton">
          <svg
            width="28"
            height="28"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M21.15 6.17C20.74 5.95 19.88 5.72 18.71 6.54L17.24 7.58C17.13 4.47 15.78 3.25 12.5 3.25H6.5C3.08 3.25 1.75 4.58 1.75 8V16C1.75 18.3 3 20.75 6.5 20.75H12.5C15.78 20.75 17.13 19.53 17.24 16.42L18.71 17.46C19.33 17.9 19.87 18.04 20.3 18.04C20.67 18.04 20.96 17.93 21.15 17.83C21.56 17.62 22.25 17.05 22.25 15.62V8.38C22.25 6.95 21.56 6.38 21.15 6.17ZM11 11.38C9.97 11.38 9.12 10.54 9.12 9.5C9.12 8.46 9.97 7.62 11 7.62C12.03 7.62 12.88 8.46 12.88 9.5C12.88 10.54 12.03 11.38 11 11.38Z"
              fill="#FF3737"
            />
          </svg>
          პირდაპირი ეთერი
        </div>
        <div className="PostButton">
          <svg
            width="28"
            height="28"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M20.6211 8.45C19.5711 3.83 15.5411 1.75 12.0011 1.75H11.9911C8.46107 1.75 4.42107 3.82 3.37107 8.44C2.20107 13.6 5.36107 17.97 8.22107 20.72C9.23479 21.7012 10.5903 22.2498 12.0011 22.25C13.3611 22.25 14.7211 21.74 15.7711 20.72C18.6311 17.97 21.7911 13.61 20.6211 8.45ZM12.0011 13.46C11.5874 13.46 11.1778 13.3785 10.7956 13.2202C10.4134 13.0619 10.0662 12.8299 9.77369 12.5374C9.48118 12.2449 9.24915 11.8976 9.09085 11.5155C8.93255 11.1333 8.85107 10.7237 8.85107 10.31C8.85107 9.89634 8.93255 9.48672 9.09085 9.10455C9.24915 8.72237 9.48118 8.37512 9.77369 8.08261C10.0662 7.79011 10.4134 7.55808 10.7956 7.39978C11.1778 7.24148 11.5874 7.16 12.0011 7.16C12.8365 7.16 13.6377 7.49187 14.2285 8.08261C14.8192 8.67335 15.1511 9.47457 15.1511 10.31C15.1511 11.1454 14.8192 11.9466 14.2285 12.5374C13.6377 13.1281 12.8365 13.46 12.0011 13.46Z"
              fill="#31C1FF"
            />
          </svg>
          ლოკაცის გაზიარება
        </div>
      </div>
    </div>
  );
}
